// BlueprintGeneratedClass BlueFireSaveGame.BlueFireSaveGame_C
// Size: 0x3a2 (Inherited: 0x28)
struct UBlueFireSaveGame_C : USaveGame {
	FSave_GameSettings GameSettings; // 0x28(0x30)
	FSave_Settings Settings; // 0x58(0x24)
	FSave_PlayerAbilities PlayerAbilities; // 0x7c(0x0a)
	FSave_PlayerStats PlayerStats; // 0x88(0xa8)
	FSave_GameStats GameStats; // 0x130(0x28)
	FSave_WorldStats WorldStats; // 0x160(0xa0)
	FSave_System System; // 0x200(0x18)
	TArray<FInventory> ShopA; // 0x218(0x10)
	TArray<FInventory> ShopB; // 0x228(0x10)
	TArray<FInventory> ShopC; // 0x238(0x10)
	TArray<FInventory> ShopD; // 0x248(0x10)
	TArray<FInventory> ShopE; // 0x258(0x10)
	TArray<FInventory> ShopF; // 0x268(0x10)
	TArray<FInventory> ShopG; // 0x278(0x10)
	TArray<enum class Items> AlreadyPickedUpItems; // 0x288(0x10)
	FPlayer_Equipment PlayerEquipment; // 0x298(0x50)
	TArray<enum class E_Emotes> Emotes; // 0x2e8(0x10)
	TArray<enum class E_DailyQuest> Today DailyQuests; // 0x2f8(0x10)
	FDateTime LastPlayDay; // 0x308(0x08)
	int32_t Selected Emote; // 0x310(0x04)
	FBuilding_Inventory_Stats Building_Inventory; // 0x318(0x30)
	TArray<FDressing_Pak> DressingSaves; // 0x348(0x10)
	TArray<FSaveQuest_Struct> Quests; // 0x358(0x10)
	FString Filename; // 0x368(0x10)
	FST_PlayerGhost PlayerGhost; // 0x378(0x14)
	TArray<FInventory> ShopH; // 0x390(0x10)
	bool HasBeatenGame; // 0x3a0(0x01)
	bool SpeedTimer; // 0x3a1(0x01)
};

