// WidgetBlueprintGeneratedClass DebugTools_UI.DebugTools_UI_C
// Size: 0x4b0 (Inherited: 0x230)
struct UDebugTools_UI_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	UWidgetAnimation* DisplayPopUp; // 0x238(0x08)
	UBorder* Border_84; // 0x240(0x08)
	UDebugTool_Option_C* DebugTool_Option; // 0x248(0x08)
	UDebugTool_Option_C* DebugTool_Option_2; // 0x250(0x08)
	UDebugTool_Option_C* DebugTool_Option_4; // 0x258(0x08)
	UDebugTool_Option_C* DebugTool_Option_46; // 0x260(0x08)
	UDebugTool_Option_C* DebugTool_Option_93; // 0x268(0x08)
	UDebugTool_Option_C* DebugTool_Option_95; // 0x270(0x08)
	UDebugTool_Option_C* DebugTool_Option_104; // 0x278(0x08)
	UDebugTool_Option_C* DebugTool_Option_113; // 0x280(0x08)
	UDebugTool_Option_C* DebugTool_Option_136; // 0x288(0x08)
	UDebugTool_Option_C* DebugTool_Option_141; // 0x290(0x08)
	UDebugTool_Option_C* DebugTool_Option_166; // 0x298(0x08)
	UDebugTool_Option_C* DebugTool_Option_198; // 0x2a0(0x08)
	UDebugTool_Option_C* DebugTool_Option_203; // 0x2a8(0x08)
	UDebugTool_Option_C* DebugTool_Option_205; // 0x2b0(0x08)
	UDebugTool_Option_C* DebugTool_Option_241; // 0x2b8(0x08)
	UDebugTool_Option_C* DebugTool_Option_278; // 0x2c0(0x08)
	UDebugTool_Option_C* DebugTool_Option_307; // 0x2c8(0x08)
	UDebugTool_Option_C* DebugTool_Option_329; // 0x2d0(0x08)
	UDebugTool_Option_C* DebugTool_Option_330; // 0x2d8(0x08)
	UDebugTool_Option_C* DebugTool_Option_352; // 0x2e0(0x08)
	UDebugTool_Option_C* DebugTool_Option_365; // 0x2e8(0x08)
	UDebugTool_Option_C* DebugTool_Option_370; // 0x2f0(0x08)
	UDebugTool_Option_C* DebugTool_Option_465; // 0x2f8(0x08)
	UDebugTool_Option_C* DebugTool_Option_472; // 0x300(0x08)
	UDebugTool_Option_C* DebugTool_Option_513; // 0x308(0x08)
	UDebugTool_Option_C* DebugTool_Option_624; // 0x310(0x08)
	UDebugTool_Option_C* DebugTool_Option_632; // 0x318(0x08)
	UDebugTool_Option_C* DebugTool_Option_639; // 0x320(0x08)
	UDebugTool_Option_C* DebugTool_Option_785; // 0x328(0x08)
	UDebugTool_Option_C* DebugTool_Option_796; // 0x330(0x08)
	UDebugTool_Option_C* DebugTool_Option_879; // 0x338(0x08)
	UDebugTool_Option_C* DebugTool_Option_C; // 0x340(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_1; // 0x348(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_252; // 0x350(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_253; // 0x358(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_255; // 0x360(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_256; // 0x368(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_257; // 0x370(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_258; // 0x378(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_259; // 0x380(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_260; // 0x388(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_261; // 0x390(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_263; // 0x398(0x08)
	UDebugTool_Option_C* DebugTool_Option_C_266; // 0x3a0(0x08)
	UTextBlock* FPS; // 0x3a8(0x08)
	UImage* Image; // 0x3b0(0x08)
	UImage* Image_1; // 0x3b8(0x08)
	UImage* Image_2; // 0x3c0(0x08)
	UImage* Image_3; // 0x3c8(0x08)
	UImage* Image_4; // 0x3d0(0x08)
	UImage* Image_5; // 0x3d8(0x08)
	UImage* Image_6; // 0x3e0(0x08)
	UImage* Image_7; // 0x3e8(0x08)
	UImage* Image_8; // 0x3f0(0x08)
	UImage* Image_9; // 0x3f8(0x08)
	UImage* Image_10; // 0x400(0x08)
	UImage* Image_11; // 0x408(0x08)
	UImage* Image_12; // 0x410(0x08)
	UImage* Image_13; // 0x418(0x08)
	UImage* Image_14; // 0x420(0x08)
	UImage* Image_15; // 0x428(0x08)
	UImage* Image_71; // 0x430(0x08)
	UImage* Image_96; // 0x438(0x08)
	UImage* Image_154; // 0x440(0x08)
	UImage* Image_208; // 0x448(0x08)
	UImage* Image_309; // 0x450(0x08)
	UTextBlock* PopUp; // 0x458(0x08)
	UScrollBox* ScrollBox_154; // 0x460(0x08)
	UTextBlock* ToolDescription; // 0x468(0x08)
	UTextBlock* ToolName; // 0x470(0x08)
	UDebugTool_Option_C* WarpToVoids; // 0x478(0x08)
	TArray<UDebugTool_Option_C*> DebugTool_OptionsArray; // 0x480(0x10)
	int32_t SelectedOption; // 0x490(0x04)
	TArray<UDebugTool_Option_C*> Tools; // 0x498(0x10)
	ADebugTools_Control_C* Control; // 0x4a8(0x08)

	void ShowControls(bool Show);
	void Construct();
	void MoveSelection(bool Up);
	void Confirm();
	void MoveSideSelection(bool Right);
	void UpdateSelection();
	void CheckFreeze();
	void Tick(FGeometry MyGeometry, float InDeltaTime);
	void ShowPopUp(FText InText);
	void ExecuteUbergraph_DebugTools_UI(int32_t EntryPoint);
};

