// UserDefinedStruct GodStone_Structure.GodStone_Structure
// Size: 0x48 (Inherited: 0x00)
struct FGodStone_Structure {
	FText Name_5_51897E264960C4605E430A9076F5F1E0; // 0x00(0x18)
	enum class Areas Area_11_22B585394A37C32086421AB3807AB4F4; // 0x18(0x01)
	bool Holy_9_16F0F1314085A638720DE0AD09BC8B85; // 0x19(0x01)
	FString DateAndTimeGrabbed_14_8EAB6EDC4C9B821BCF29028FD8CF1BCB; // 0x20(0x10)
	bool Collected_17_A24FE19D4DDDDA9298F5CB9473F0D787; // 0x30(0x01)
	int32_t Index_20_7318352D4F2AC92BEFCFD9A917C03185; // 0x34(0x04)
	UTexture2D* Texture_23_362E046E4418B1E533E86DBBCE82D1D6; // 0x38(0x08)
	int32_t Shards_26_2F711C814D4C132DFFCD1987026CCE2C; // 0x40(0x04)
	int32_t IndexArray_29_F377660B48D00C64710A158086B156F8; // 0x44(0x04)
};

