// WidgetBlueprintGeneratedClass Inventory.Inventory_C
// Size: 0xc64 (Inherited: 0x230)
struct UInventory_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	UWidgetAnimation* ResetControls; // 0x238(0x08)
	UWidgetAnimation* FadeSaveBox; // 0x240(0x08)
	UWidgetAnimation* FadeConfirmationBox; // 0x248(0x08)
	UWidgetAnimation* FadeTabChange; // 0x250(0x08)
	UWidgetAnimation* PC_RemapPromptFadeIn; // 0x258(0x08)
	UWidgetAnimation* NewKeyPromptPC; // 0x260(0x08)
	UWidgetAnimation* SpiritMessageanim; // 0x268(0x08)
	UWidgetAnimation* JournalTabSwitch; // 0x270(0x08)
	UWidgetAnimation* InventoryArrows; // 0x278(0x08)
	UWidgetAnimation* AmuletRefresh; // 0x280(0x08)
	UWidgetAnimation* SwordChange; // 0x288(0x08)
	UWidgetAnimation* ChangeinventoryTabAnim; // 0x290(0x08)
	UWidgetAnimation* DescriptionChange; // 0x298(0x08)
	UWidgetAnimation* FadeIn; // 0x2a0(0x08)
	UWidgetAnimation* ChangeTabAnim; // 0x2a8(0x08)
	UCanvasPanel* Achievements; // 0x2b0(0x08)
	UScrollBox* AchievementsScrollBox; // 0x2b8(0x08)
	UBorder* ActionsBorder; // 0x2c0(0x08)
	UBorder* ActionsBorder_2; // 0x2c8(0x08)
	UBorder* ActionsBorder_3; // 0x2d0(0x08)
	UQuest_Option_C* ActivatetheSteamFortressElevator; // 0x2d8(0x08)
	UAmulet_C* Amulet; // 0x2e0(0x08)
	UAmulet_C* Amulet_90; // 0x2e8(0x08)
	UAmulet_C* Amulet_207; // 0x2f0(0x08)
	UAmulet_C* Amulet_293; // 0x2f8(0x08)
	UAmulet_C* Amulet_430; // 0x300(0x08)
	UAmulet_C* Amulet_526; // 0x308(0x08)
	UAmulet_C* Amulet_605; // 0x310(0x08)
	UAmulet_C* Amulet_716; // 0x318(0x08)
	UAmulet_C* Amulet_851; // 0x320(0x08)
	UAmulet_C* Amulet_C_1; // 0x328(0x08)
	UAmulet_C* Amulet_C_2; // 0x330(0x08)
	UAmulet_C* Amulet_C_3; // 0x338(0x08)
	UAmulet_C* Amulet_C_4; // 0x340(0x08)
	UAmulet_C* Amulet_C_5; // 0x348(0x08)
	UAmulet_C* Amulet_C_6; // 0x350(0x08)
	UAmulet_C* Amulet_C_7; // 0x358(0x08)
	UAmulet_C* Amulet_C_8; // 0x360(0x08)
	UAmulet_C* Amulet_C_9; // 0x368(0x08)
	UAmuletSlot_C* AmuletSlot; // 0x370(0x08)
	UAmuletSlot_C* AmuletSlot_82; // 0x378(0x08)
	UAmuletSlot_C* AmuletSlot_165; // 0x380(0x08)
	UAmuletSlot_C* AmuletSlot_452; // 0x388(0x08)
	UAmuletSlot_C* AmuletSlot_866; // 0x390(0x08)
	UAmuletSlot_C* AmuletSlot_C_1069; // 0x398(0x08)
	UHorizontalBox* AmuletSlotsBox; // 0x3a0(0x08)
	UWrapBox* AmuletWrap; // 0x3a8(0x08)
	UImage* ArrowLeft; // 0x3b0(0x08)
	UImage* ArrowRight; // 0x3b8(0x08)
	UImage* Bar_Bottom; // 0x3c0(0x08)
	UImage* Bar_Top; // 0x3c8(0x08)
	UQuest_Option_C* BarriRoses; // 0x3d0(0x08)
	UQuest_Option_C* Beira; // 0x3d8(0x08)
	UImage* BlackBackground; // 0x3e0(0x08)
	UImage* BlackBackground_2; // 0x3e8(0x08)
	UQuest_Option_C* BookHunting; // 0x3f0(0x08)
	UBorder* Border_1; // 0x3f8(0x08)
	UBorder* Border_46; // 0x400(0x08)
	UQuest_Option_C* BremurPicture; // 0x408(0x08)
	UTextBlock* Cash; // 0x410(0x08)
	UTextBlock* Category; // 0x418(0x08)
	UTextBlock* Center_Title; // 0x420(0x08)
	UImage* CenterAmulet; // 0x428(0x08)
	UImage* CircleA; // 0x430(0x08)
	UImage* CircleB; // 0x438(0x08)
	UImage* CircleC; // 0x440(0x08)
	UImage* CircleD; // 0x448(0x08)
	UQuest_Option_C* ClearallVoids; // 0x450(0x08)
	UOverlay* ConfirmationBox; // 0x458(0x08)
	UWidgetSwitcher* ControlPlatformSwitch; // 0x460(0x08)
	UCanvasPanel* Controls; // 0x468(0x08)
	UControlsUI_PS_C* ControlsUI_PS; // 0x470(0x08)
	UControlsUI_Stadia_C* ControlsUI_Stadia; // 0x478(0x08)
	UControlsUI_Switch_C* ControlsUI_Switch; // 0x480(0x08)
	UControlsUI_Xbox_C* ControlsUI_Xbox; // 0x488(0x08)
	UTextBlock* CurrentJournalTab; // 0x490(0x08)
	UWrapBox* CurrentStatWrapBox; // 0x498(0x08)
	UTextBlock* Description; // 0x4a0(0x08)
	UImage* DescriptionBar; // 0x4a8(0x08)
	UBorder* DescriptionBorder; // 0x4b0(0x08)
	UImage* DescriptionImage; // 0x4b8(0x08)
	UQuest_Option_C* DestroytheGoddess; // 0x4c0(0x08)
	UQuest_Option_C* DestroytheNuosCorruption; // 0x4c8(0x08)
	UQuest_Option_C* DestroytheShadowLords; // 0x4d0(0x08)
	UQuest_Option_C* DestroytheUthasCorruption; // 0x4d8(0x08)
	UQuest_Option_C* ElevatorDuties; // 0x4e0(0x08)
	UQuest_Option_C* EnterTheVoid; // 0x4e8(0x08)
	UWrapBox* FileSelectedConfirmationBox; // 0x4f0(0x08)
	UWrapBox* FileSelectedConfirmationBox_2; // 0x4f8(0x08)
	UQuest_Option_C* FindFaraMother; // 0x500(0x08)
	UQuest_Option_C* FindTheNuosTemple; // 0x508(0x08)
	UQuest_Option_C* FindtheUthasTemple; // 0x510(0x08)
	UCanvasPanel* Game; // 0x518(0x08)
	UScrollBox* GameOptionsScroll; // 0x520(0x08)
	UTextBlock* GamePercent; // 0x528(0x08)
	UQuest_Option_C* GardenSanctuary; // 0x530(0x08)
	UCanvasPanel* Godstones; // 0x538(0x08)
	UScrollBox* GodStonesScrollBox; // 0x540(0x08)
	UCanvasPanel* Graphics; // 0x548(0x08)
	UScrollBox* GraphicsOptionsScroll; // 0x550(0x08)
	UQuest_Option_C* GraveSanctuary; // 0x558(0x08)
	UImage* Image; // 0x560(0x08)
	UImage* Image_1; // 0x568(0x08)
	UImage* Image_2; // 0x570(0x08)
	UImage* Image_5; // 0x578(0x08)
	UImage* Image_6; // 0x580(0x08)
	UImage* Image_57; // 0x588(0x08)
	UImage* Image_87; // 0x590(0x08)
	UImage* Image_99; // 0x598(0x08)
	UImage* Image_112; // 0x5a0(0x08)
	UImage* Image_175; // 0x5a8(0x08)
	UImage* Image_176; // 0x5b0(0x08)
	UImage* Image_184; // 0x5b8(0x08)
	UImage* Image_569; // 0x5c0(0x08)
	UCanvasPanel* Inventory; // 0x5c8(0x08)
	UInventory_GodStone_C* Inventory_GodStone; // 0x5d0(0x08)
	UInventory_GodStone_C* Inventory_GodStone_115; // 0x5d8(0x08)
	UInventory_GodStone_C* Inventory_GodStone_116; // 0x5e0(0x08)
	UInventory_GodStone_C* Inventory_GodStone_117; // 0x5e8(0x08)
	UInventory_GodStone_C* Inventory_GodStone_118; // 0x5f0(0x08)
	UInventory_GodStone_C* Inventory_GodStone_119; // 0x5f8(0x08)
	UInventory_GodStone_C* Inventory_GodStone_120; // 0x600(0x08)
	UInventory_GodStone_C* Inventory_GodStone_121; // 0x608(0x08)
	UInventory_GodStone_C* Inventory_GodStone_122; // 0x610(0x08)
	UInventory_GodStone_C* Inventory_GodStone_123; // 0x618(0x08)
	UInventory_GodStone_C* Inventory_GodStone_124; // 0x620(0x08)
	UInventory_GodStone_C* Inventory_GodStone_154; // 0x628(0x08)
	UInventory_GodStone_C* Inventory_GodStone_272; // 0x630(0x08)
	UInventory_GodStone_C* Inventory_GodStone_464; // 0x638(0x08)
	UInventory_GodStone_C* Inventory_GodStone_559; // 0x640(0x08)
	UInventory_GodStone_C* Inventory_GodStone_695; // 0x648(0x08)
	UInventoryActionList_C* InventoryActionList; // 0x650(0x08)
	UInventoryItemScreen_C* InventoryItemScreen; // 0x658(0x08)
	UInventoryItemScreen_C* InventoryItemScreen_2; // 0x660(0x08)
	UInventoryItemScreen_C* InventoryItemScreen_122; // 0x668(0x08)
	UInventoryItemScreen_C* InventoryItemScreen_239; // 0x670(0x08)
	UInventorySpacer_C* InventorySpacer_107; // 0x678(0x08)
	UWrapBox* InventoryWrap; // 0x680(0x08)
	UItemEffect_C* ItemEffect; // 0x688(0x08)
	UItemEffect_C* ItemEffect_68; // 0x690(0x08)
	UItemEffect_C* ItemEffect_152; // 0x698(0x08)
	UItemEffect_C* ItemEffect_212; // 0x6a0(0x08)
	UItemEffect_C* ItemEffect_289; // 0x6a8(0x08)
	UItemEffect_C* ItemEffect_C_1; // 0x6b0(0x08)
	UItemEffect_C* ItemEffect_C_2; // 0x6b8(0x08)
	UItemEffect_C* ItemEffect_C_3; // 0x6c0(0x08)
	UItemEffect_C* ItemEffect_C_4; // 0x6c8(0x08)
	UItemEffect_C* ItemEffect_C_5; // 0x6d0(0x08)
	UTextBlock* ItemName; // 0x6d8(0x08)
	UCanvasPanel* Journal; // 0x6e0(0x08)
	UWidgetSwitcher* JournalTabs; // 0x6e8(0x08)
	UTextBlock* Left_Title; // 0x6f0(0x08)
	UBorder* MainBorder; // 0x6f8(0x08)
	UCanvasPanel* MainSettings; // 0x700(0x08)
	UTextBlock* MappingNotePc; // 0x708(0x08)
	UMenu_ConfirmationBox_C* Menu_ConfirmationBox_Left; // 0x710(0x08)
	UMenu_ConfirmationBox_C* Menu_ConfirmationBox_Left_2; // 0x718(0x08)
	UMenu_ConfirmationBox_C* Menu_ConfirmationBox_Right; // 0x720(0x08)
	UQuest_Option_C* MonKeys; // 0x728(0x08)
	UTextBlock* NextJournalTab; // 0x730(0x08)
	UQuest_Option_C* Nuno; // 0x738(0x08)
	UOptionMaster_C* OptionEffectsVol; // 0x740(0x08)
	UOptionMaster_C* OptionIdleCamMovement; // 0x748(0x08)
	UOptionMaster_C* OptionMaster_Antialising; // 0x750(0x08)
	UOptionMaster_C* OptionMaster_C_1; // 0x758(0x08)
	UOptionMaster_C* OptionMaster_C_2; // 0x760(0x08)
	UOptionMaster_C* OptionMaster_C_3; // 0x768(0x08)
	UOptionMaster_C* OptionMaster_C_6; // 0x770(0x08)
	UOptionMaster_C* OptionMaster_CamAutoAdjust; // 0x778(0x08)
	UOptionMaster_C* OptionMaster_CameraShakes; // 0x780(0x08)
	UOptionMaster_C* OptionMaster_FPSLimit; // 0x788(0x08)
	UOptionMaster_C* OptionMaster_MotionBlur; // 0x790(0x08)
	UOptionMaster_C* OptionMaster_PPQuality; // 0x798(0x08)
	UOptionMaster_C* OptionMaster_RestoreDef; // 0x7a0(0x08)
	UOptionMaster_C* OptionMaster_Rumble; // 0x7a8(0x08)
	UOptionMaster_C* OptionMaster_ScreenMode; // 0x7b0(0x08)
	UOptionMaster_C* OptionMaster_ShadowQuality; // 0x7b8(0x08)
	UOptionMaster_C* OptionMaster_TextureQuality; // 0x7c0(0x08)
	UOptionMaster_C* OptionMasterScreenRes; // 0x7c8(0x08)
	UOptionMaster_C* OptionMusicVol; // 0x7d0(0x08)
	UOptionMaster_C* OptionSmoothCamRotation; // 0x7d8(0x08)
	UQuest_Option_C* PaulaleConcert; // 0x7e0(0x08)
	UCanvasPanel* PC; // 0x7e8(0x08)
	UTextBlock* PC_ActionRemap; // 0x7f0(0x08)
	UAction_Remap_Option_C* PC_Camera; // 0x7f8(0x08)
	UAction_Remap_Option_C* PC_Dash; // 0x800(0x08)
	UAction_Remap_Option_C* PC_EmoteMenu; // 0x808(0x08)
	UAction_Remap_Option_C* PC_Horizontal_Attack; // 0x810(0x08)
	UAction_Remap_Option_C* PC_Interact; // 0x818(0x08)
	UAction_Remap_Option_C* PC_Jump; // 0x820(0x08)
	UWrapBox* PC_KeyMap_Options; // 0x828(0x08)
	UTextBlock* PC_KeyMappingPrompt; // 0x830(0x08)
	UAction_Remap_Option_C* PC_Lock; // 0x838(0x08)
	UAction_Remap_Option_C* PC_LockSwitch; // 0x840(0x08)
	UAction_Remap_Option_C* PC_Movement; // 0x848(0x08)
	UAction_Remap_Option_C* PC_Pause; // 0x850(0x08)
	UAction_Remap_Option_C* PC_QuickEmote; // 0x858(0x08)
	UOverlay* PC_Remap_Prompt_NewKey; // 0x860(0x08)
	UAction_Remap_Option_C* PC_RestoreHealth; // 0x868(0x08)
	UAction_Remap_Option_C* PC_Shield; // 0x870(0x08)
	UAction_Remap_Option_C* PC_Sprint; // 0x878(0x08)
	UAction_Remap_Option_C* PC_Vertical_Attack; // 0x880(0x08)
	UImage* PlayerImage; // 0x888(0x08)
	UTextBlock* PreviousJournalTab; // 0x890(0x08)
	UCanvasPanel* PS4; // 0x898(0x08)
	UTextBlock* QuesProgress_2; // 0x8a0(0x08)
	UOverlay* QuestDescriptionOverlay; // 0x8a8(0x08)
	UImage* QuestImage; // 0x8b0(0x08)
	UImage* QuestImageBar; // 0x8b8(0x08)
	UTextBlock* QuestNames; // 0x8c0(0x08)
	UCanvasPanel* Quests; // 0x8c8(0x08)
	UScrollBox* QuestsScrollBox; // 0x8d0(0x08)
	UTextBlock* QuestType; // 0x8d8(0x08)
	UAction_Remap_Option_C* RestoreToDefaults; // 0x8e0(0x08)
	URetainerBox* RetainerBox_1; // 0x8e8(0x08)
	URichTextBlock* RichTextBlock_101; // 0x8f0(0x08)
	UTextBlock* Right_Title; // 0x8f8(0x08)
	UQuest_Option_C* Samael; // 0x900(0x08)
	UOverlay* SaveBox; // 0x908(0x08)
	USelectCommands_C* SelectCommands; // 0x910(0x08)
	USelectCommands_C* SelectCommands_2; // 0x918(0x08)
	USelectCommands_C* SelectCommands_78; // 0x920(0x08)
	USelectCommands_C* SelectCommands_247; // 0x928(0x08)
	UImage* SeparatorBar01; // 0x930(0x08)
	UImage* SeparatorBar02; // 0x938(0x08)
	UImage* SeperatorBar; // 0x940(0x08)
	UCanvasPanel* Settings; // 0x948(0x08)
	UTextBlock* SettingsDescription; // 0x950(0x08)
	UWrapBox* SettingsMainWrap; // 0x958(0x08)
	UWidgetSwitcher* SettingsSwitcher; // 0x960(0x08)
	USettingsText_C* SettingsText; // 0x968(0x08)
	USettingsText_C* SettingsText_1; // 0x970(0x08)
	USettingsText_C* SettingsText_2; // 0x978(0x08)
	USettingsText_C* SettingsText_3; // 0x980(0x08)
	USettingsText_C* SettingsText_4; // 0x988(0x08)
	USettingsText_C* SettingsText_C_4; // 0x990(0x08)
	UBorder* ShoulderTabsButtons; // 0x998(0x08)
	UTextBlock* SpiritDescription; // 0x9a0(0x08)
	UQuest_Option_C* SpiritHunting; // 0x9a8(0x08)
	UTextBlock* SpiritName; // 0x9b0(0x08)
	UTextBlock* SpiritReturn; // 0x9b8(0x08)
	UTextBlock* SpiritReturn_2; // 0x9c0(0x08)
	UCanvasPanel* Spirits; // 0x9c8(0x08)
	UCanvasPanel* Stadia; // 0x9d0(0x08)
	UCanvasPanel* Stats; // 0x9d8(0x08)
	UWrapBox* StatsWrapBox; // 0x9e0(0x08)
	UCanvasPanel* Switch; // 0x9e8(0x08)
	UBorder* TabBorder; // 0x9f0(0x08)
	UWidgetSwitcher* Tabs; // 0x9f8(0x08)
	UImage* TabSwitcherIcon_Left; // 0xa00(0x08)
	UImage* TabSwitcherIcon_Right; // 0xa08(0x08)
	UTextBlock* TextBlock_1; // 0xa10(0x08)
	UTextBlock* TextBlock_5; // 0xa18(0x08)
	UTextBlock* TimePlayed; // 0xa20(0x08)
	UWrapBox* WrapBox_1; // 0xa28(0x08)
	UCanvasPanel* XboxPlatform; // 0xa30(0x08)
	UBlueFire_Game_Instance_C* GameInstance; // 0xa38(0x08)
	UPickUp_Action_UI_C* ActionWidget; // 0xa40(0x08)
	int32_t SelectedItem; // 0xa48(0x04)
	TArray<UInventoryItem_C*> InventoryItems; // 0xa50(0x10)
	APlayer_Camera_Control_C* CameraControl; // 0xa60(0x08)
	enum class Tabs Tab; // 0xa68(0x01)
	APlayer_Character_BP_C* Player; // 0xa70(0x08)
	int32_t Percent; // 0xa78(0x04)
	int32_t SettingsMainSelectionIndex; // 0xa7c(0x04)
	int32_t SettingsActiveTab; // 0xa80(0x04)
	int32_t SettingsGameSelectionIndex; // 0xa84(0x04)
	int32_t SettingsGraphicsSelectionIndex; // 0xa88(0x04)
	int32_t InventoryTab; // 0xa8c(0x04)
	int32_t SelectedKeyItem; // 0xa90(0x04)
	TArray<UInventoryItem_C*> InventoryPassiveItems; // 0xa98(0x10)
	int32_t MaxPassiveItems; // 0xaa8(0x04)
	int32_t SelectedSword; // 0xaac(0x04)
	TArray<UAmulet_C*> AmuletList; // 0xab0(0x10)
	int32_t SelectedAmulet; // 0xac0(0x04)
	bool UsedAmuletSlot; // 0xac4(0x01)
	bool SwordHovered; // 0xac5(0x01)
	bool SwordSelectedConfirm; // 0xac6(0x01)
	int32_t SelectedWeapon; // 0xac8(0x04)
	TArray<UInventoryItem_C*> InventorySwords; // 0xad0(0x10)
	bool SwordHas; // 0xae0(0x01)
	int32_t SelectedTunic; // 0xae4(0x04)
	TArray<UInventoryItem_C*> InventoryTunics; // 0xae8(0x10)
	bool TunicHas; // 0xaf8(0x01)
	APlayerRenderTargetModel_C* RenderTargetModel; // 0xb00(0x08)
	APlayerRenderTargetModel_C* RenderTargetModelAlpha; // 0xb08(0x08)
	AInventoryController_C* InventoryController; // 0xb10(0x08)
	int32_t JournalTab; // 0xb18(0x04)
	int32_t SelectedGodStone; // 0xb1c(0x04)
	int32_t SelectedAchievement; // 0xb20(0x04)
	TArray<UInventory_GodStone_C*> GodStoneArray; // 0xb28(0x10)
	bool ItemActionList; // 0xb38(0x01)
	UInventoryActionList_C* ItemActionListWidget; // 0xb40(0x08)
	FVector2D Pos; // 0xb48(0x08)
	TArray<UWidget*> ToDelete; // 0xb50(0x10)
	FMulticastInlineDelegate RemoveCall; // 0xb60(0x10)
	FMulticastInlineDelegate ChangeTabCall; // 0xb70(0x10)
	TArray<UQuest_Option_C*> QuestList; // 0xb80(0x10)
	TArray<enum class Quests> Quest; // 0xb90(0x10)
	int32_t SelectedQuestIndex; // 0xba0(0x04)
	TArray<UWidget*> QuestChildren; // 0xba8(0x10)
	int32_t NItemsScreens; // 0xbb8(0x04)
	int32_t NKeyItemsScreens; // 0xbbc(0x04)
	int32_t NTunicsScreens; // 0xbc0(0x04)
	int32_t NWeaponScreens; // 0xbc4(0x04)
	int32_t CurrentScreenInCategory; // 0xbc8(0x04)
	bool Scroll; // 0xbcc(0x01)
	float CurrentScroll; // 0xbd0(0x04)
	float TargetScroll; // 0xbd4(0x04)
	bool KeyMapListen; // 0xbd8(0x01)
	int32_t PCMapOptionSelectedIndex; // 0xbdc(0x04)
	FName PC_KeyToReMap; // 0xbe0(0x08)
	TArray<FName> PC_Default_KeysToMap; // 0xbe8(0x10)
	TArray<FKey> PC_Default_KeysToMapKeys; // 0xbf8(0x10)
	FKey PC_PreviousKey; // 0xc08(0x18)
	bool KeyMapListenReady; // 0xc20(0x01)
	TArray<FKey> PC_RemapBlockedKeys; // 0xc28(0x10)
	int32_t SelectedVoid; // 0xc38(0x04)
	bool ConfirmationWaiting; // 0xc3c(0x01)
	FMulticastInlineDelegate ConfirmationReturn; // 0xc40(0x10)
	int32_t ConfirmationSelection; // 0xc50(0x04)
	bool SaveUIOn; // 0xc54(0x01)
	float CustomDeltaTime; // 0xc58(0x04)
	bool TimeFix; // 0xc5c(0x01)
	int32_t LastSelected; // 0xc60(0x04)

	FEventReply On_TabSwitcherIcon_Right_MouseButtonDown_1(FGeometry MyGeometry, FPointerEvent MouseEvent);
	FEventReply On_TabSwitcherIcon_Left_MouseButtonDown_1(FGeometry MyGeometry, FPointerEvent MouseEvent);
	void Delete();
	void UpdateDescription(enum class InventoryItemType Type);
	void ChangeTab(bool Right, bool ReloadOnly, bool InitialLoad);
	void UpdateItemText(FText Description, FText Name, UMaterialInterface* Material);
	void HideDescriptionBox();
	void Confirm(APlayer_Character_BP_C* Target);
	void Back();
	void ThumbstickHorizontalMovement(bool Right);
	void MoveCursor();
	void MoveCursorError();
	void PCGamepadChange(bool PC);
	void MoveSelection(enum class Directions Direction);
	void Change();
	void Update Void();
	void Set Time Played And Percent();
	void IsValid Move Cursor(bool IsValid);
	void StartJournalTab();
	void Remove(bool NoReturnInput, bool UnfreezeEnemies);
	void UpdateQuest();
	void Construct();
	void Move(float AxisValue);
	void SetJournalTabName();
	void ChangeJournalTab(bool Right);
	void MoveJournalTabSelection(enum class Directions Direction, bool RefreshOnly);
	void SetJournalTabContent();
	void Remove Popup();
	void CustomTick(float DeltaTime);
	void RemoveInventoryOp();
	void RefreshTunics();
	void RefreshWeapons();
	void AnimateScroll(float TargetScroll);
	void Tick(FGeometry MyGeometry, float InDeltaTime);
	void AddSplit();
	void AdjustPositionX(bool Pos);
	void AdjustPosition(bool Pos);
	void BackItemActionList();
	void InstantRemoveItemActionList();
	void LoadTunics();
	void LoadWeapons();
	void StartArrows();
	void ContinueAnimSwitchTab(bool Refresh);
	void InventoryConfirmInput(APlayer_Character_BP_C* Player);
	void UpdateActionText(bool Valid);
	void QuickInventoryTabChange(bool Right);
	void LoadInventoryKeyItems();
	void LoadInventoryItems();
	void ChangeInventoryTab(bool Right, bool Refresh);
	void InventoryRecieveMovement(enum class Directions Directions, bool RefreshOnly);
	void SetInventoryContent();
	void DropItem();
	void EquipItem(APlayer_Character_BP_C* Player);
	void UpdateAction();
	void UpdateSelectionCursor();
	void LoadItems();
	void RefreshAllGame();
	void EnableInput();
	void DisableInput();
	void SaveUIOff();
	void SaveUI();
	void CustomEvent(bool Condition);
	void ConfirmationBoxRecieveMovement(bool Right, bool Refresh);
	void ConfirmationPopUpClick();
	void ReturnQuitMenu(bool Condition);
	void ConfirmationPopUp();
	void RefreshAll();
	void ErrorMapping();
	void ExitMapping();
	void PC_KeysRestoreToDefault();
	void PC_SetRemapKey(FKey InputPin);
	void PC_CancelRemap();
	void PC_EndRemap(bool OnlySelected);
	void PC_StartRemap();
	void PC_InitializeButtonMapping(bool OnlySelected);
	void SetBottomSettingDescription(FText InText);
	void ChangeSettingsTab(int32_t NewTab);
	void SettingsRecieveBack();
	void SettingsRecieveConfirmation();
	void SettingsRecieveMovement(enum class Directions Directions, bool RefreshOnly);
	void SpiritMessage(FText InText);
	void RecieveMouseHoverSpirit(int32_t SelectedAmulet);
	void SpiritRefresh();
	void SpiritConfirmInput(APlayer_Character_BP_C* Player);
	void UpdateWeaponActionText(bool Valid);
	void WeaponRecieveMovement(enum class Directions Directions, bool RefreshOnly);
	void BeginSpiritTab();
	void UpdateWeaponActions();
	void WeaponUpdateSelectionCursor();
	void ExecuteUbergraph_Inventory(int32_t EntryPoint);
	void ConfirmationReturn__DelegateSignature(bool Condition);
	void ChangeTabCall__DelegateSignature();
	void RemoveCall__DelegateSignature();
};

