// WidgetBlueprintGeneratedClass InventoryItemScreen.InventoryItemScreen_C
// Size: 0x298 (Inherited: 0x230)
struct UInventoryItemScreen_C : UUserWidget {
	UInventoryItem_C* InventoryItem; // 0x230(0x08)
	UInventoryItem_C* InventoryItem_63; // 0x238(0x08)
	UInventoryItem_C* InventoryItem_115; // 0x240(0x08)
	UInventoryItem_C* InventoryItem_169; // 0x248(0x08)
	UInventoryItem_C* InventoryItem_258; // 0x250(0x08)
	UInventoryItem_C* InventoryItem_342; // 0x258(0x08)
	UInventoryItem_C* InventoryItem_418; // 0x260(0x08)
	UInventoryItem_C* InventoryItem_488; // 0x268(0x08)
	UInventoryItem_C* InventoryItem_566; // 0x270(0x08)
	UInventoryItem_C* InventoryItem_C_19; // 0x278(0x08)
	UInventoryItem_C* InventoryItem_C_20; // 0x280(0x08)
	UInventoryItem_C* InventoryItem_C_21; // 0x288(0x08)
	UWrapBox* ItemsBox; // 0x290(0x08)
};

