// UserDefinedStruct Item.Item
// Size: 0x63 (Inherited: 0x00)
struct FItem {
	FText Name_14_384F37DA4D765E021432419EE268E50B; // 0x00(0x18)
	FText Description_7_F7E938484D4BB343BF8906B34A1997FE; // 0x18(0x18)
	UMaterialInstance* Material_9_5D360F4B4026A3E9CDA28083C1503140; // 0x30(0x08)
	UStaticMesh* Mesh_17_E8BD25AB44357A033686B0B11CB7EC66; // 0x38(0x08)
	bool HasAmount_19_7A4435824CF99C518E578E9C43E53BDC; // 0x40(0x01)
	int32_t BuyPrice_23_F9E6783840D7F25E8FC9E7839774E56A; // 0x44(0x04)
	int32_t SellPrice_25_4AE0231C4F5F1B8BA13DC6AC8B09BBFD; // 0x48(0x04)
	bool KeyItem_27_CD054F234111A191E70D17BCC998E807; // 0x4c(0x01)
	TArray<FItemEffectInfo> Labels_37_B26DB2704B31466F206A6EAF2AF884AD; // 0x50(0x10)
	bool ShowStat_39_652DA91B4AA3DBD25165CBA9DEA51036; // 0x60(0x01)
	bool RareItem_41_66DC35014674AEEB7661F0BB4B043A05; // 0x61(0x01)
	bool SpecialKeyItemFunction_43_DFDD79B547E9AD17204E7DB8D9C4107E; // 0x62(0x01)
};

