// WidgetBlueprintGeneratedClass MainDialogWB.MainDialogWB_C
// Size: 0x754 (Inherited: 0x230)
struct UMainDialogWB_C : UUserWidget {
	FPointerToUberGraphFrame UberGraphFrame; // 0x230(0x08)
	UWidgetAnimation* TextFadeStyle; // 0x238(0x08)
	UWidgetAnimation* PressOption; // 0x240(0x08)
	UWidgetAnimation* ShowShop; // 0x248(0x08)
	UWidgetAnimation* InventoryTabSwitch; // 0x250(0x08)
	UWidgetAnimation* ActionsBorderFadeIn; // 0x258(0x08)
	UWidgetAnimation* MainFade; // 0x260(0x08)
	UWidgetAnimation* FadeIn; // 0x268(0x08)
	UWidgetAnimation* AutomaticFadeIn; // 0x270(0x08)
	UWidgetAnimation* GlowButton; // 0x278(0x08)
	UTextBlock* AcceptAction; // 0x280(0x08)
	UBorder* ActionsBorder; // 0x288(0x08)
	URichTextBlock* ActualText; // 0x290(0x08)
	UImage* Background; // 0x298(0x08)
	UBorder* BorderResponses; // 0x2a0(0x08)
	UBorder* BorderText; // 0x2a8(0x08)
	UTextBlock* CancelAction; // 0x2b0(0x08)
	UImage* CancelButton; // 0x2b8(0x08)
	UTextBlock* Category; // 0x2c0(0x08)
	UTextBlock* CharacterName; // 0x2c8(0x08)
	UImage* CircleA; // 0x2d0(0x08)
	UImage* CircleB; // 0x2d8(0x08)
	UOverlay* Currency; // 0x2e0(0x08)
	UTextBlock* CurrencyAmount; // 0x2e8(0x08)
	UDialogOption_C* DialogOption; // 0x2f0(0x08)
	UDialogOption_C* DialogOption_84; // 0x2f8(0x08)
	UImage* Image; // 0x300(0x08)
	UImage* Image_1; // 0x308(0x08)
	UImage* Image_2; // 0x310(0x08)
	UImage* Image_3; // 0x318(0x08)
	UImage* Image_4; // 0x320(0x08)
	UImage* Image_5; // 0x328(0x08)
	UImage* Image_6; // 0x330(0x08)
	UImage* Image_7; // 0x338(0x08)
	UImage* Image_8; // 0x340(0x08)
	UImage* Image_9; // 0x348(0x08)
	UImage* Image_10; // 0x350(0x08)
	UImage* Image_11; // 0x358(0x08)
	UImage* Image_12; // 0x360(0x08)
	UImage* Image_13; // 0x368(0x08)
	UImage* Image_14; // 0x370(0x08)
	UImage* Image_56; // 0x378(0x08)
	UImage* Image_200; // 0x380(0x08)
	UBorder* InventoryBorder; // 0x388(0x08)
	UInventoryItem_C* InventoryItem; // 0x390(0x08)
	UInventoryItem_C* InventoryItem_1; // 0x398(0x08)
	UInventoryItem_C* InventoryItem_2; // 0x3a0(0x08)
	UInventoryItem_C* InventoryItem_3; // 0x3a8(0x08)
	UInventoryItem_C* InventoryItem_63; // 0x3b0(0x08)
	UInventoryItem_C* InventoryItem_115; // 0x3b8(0x08)
	UInventoryItem_C* InventoryItem_169; // 0x3c0(0x08)
	UInventoryItem_C* InventoryItem_258; // 0x3c8(0x08)
	UInventoryItem_C* InventoryItem_342; // 0x3d0(0x08)
	UInventoryItem_C* InventoryItem_418; // 0x3d8(0x08)
	UInventoryItem_C* InventoryItem_488; // 0x3e0(0x08)
	UInventoryItem_C* InventoryItem_566; // 0x3e8(0x08)
	UInventoryItem_C* InventoryItem_C_1; // 0x3f0(0x08)
	UInventoryItem_C* InventoryItem_C_2; // 0x3f8(0x08)
	UInventoryItem_C* InventoryItem_C_3; // 0x400(0x08)
	UInventoryItem_C* InventoryItem_C_4; // 0x408(0x08)
	UInventoryItem_C* InventoryItem_C_5; // 0x410(0x08)
	UInventoryItem_C* InventoryItem_C_6; // 0x418(0x08)
	UInventoryItem_C* InventoryItem_C_7; // 0x420(0x08)
	UInventoryItem_C* InventoryItem_C_8; // 0x428(0x08)
	UInventoryItem_C* InventoryItem_C_9; // 0x430(0x08)
	UTextBlock* InventoryItemName; // 0x438(0x08)
	UWidgetSwitcher* InventorySwitcher; // 0x440(0x08)
	UWrapBox* ItemsBox; // 0x448(0x08)
	UWrapBox* KeyItemsBox; // 0x450(0x08)
	UBorder* MainBorder; // 0x458(0x08)
	UImage* Ok; // 0x460(0x08)
	UTextBlock* PlayerSouls; // 0x468(0x08)
	UTextBlock* Price; // 0x470(0x08)
	UWrapBox* ReponsesBox; // 0x478(0x08)
	URichTextBlock* SetShape; // 0x480(0x08)
	UBorder* ShopBorder; // 0x488(0x08)
	UTextBlock* ShopCurrencyAmount; // 0x490(0x08)
	UTextBlock* ShopCurrencyAmount_2; // 0x498(0x08)
	UTextBlock* ShopDescription; // 0x4a0(0x08)
	UImage* ShopItemMaterial; // 0x4a8(0x08)
	UShopItemWBP_C* ShopItemWBP; // 0x4b0(0x08)
	UShopItemWBP_C* ShopItemWBP_74; // 0x4b8(0x08)
	UShopItemWBP_C* ShopItemWBP_187; // 0x4c0(0x08)
	UShopItemWBP_C* ShopItemWBP_C_1; // 0x4c8(0x08)
	UShopItemWBP_C* ShopItemWBP_C_2; // 0x4d0(0x08)
	UShopItemWBP_C* ShopItemWBP_C_3; // 0x4d8(0x08)
	UTextBlock* ShopMainItem; // 0x4e0(0x08)
	UScrollBox* ShopScrollBox; // 0x4e8(0x08)
	UImage* SimpleGlow; // 0x4f0(0x08)
	UTextBlock* SwordDamage; // 0x4f8(0x08)
	UTextBlock* TextBlock_1; // 0x500(0x08)
	float Speed; // 0x508(0x04)
	FMulticastInlineDelegate ExitDialog; // 0x510(0x10)
	bool MessageFinished; // 0x520(0x01)
	bool LastLine; // 0x521(0x01)
	int32_t CurrentLine; // 0x524(0x04)
	int32_t TotalLines; // 0x528(0x04)
	TArray<FText> Text; // 0x530(0x10)
	AMainDialogController_C* TextController; // 0x540(0x08)
	bool NextCharacterIsMarker; // 0x548(0x01)
	enum class TextMarkerTypes Markertype; // 0x549(0x01)
	UTextBlock* CurrentTextBox; // 0x550(0x08)
	FLinearColor TextColor; // 0x558(0x10)
	UObject* GameInstanceRef; // 0x568(0x08)
	char InputImageEnum; // 0x570(0x01)
	bool MessageIsQuestion; // 0x571(0x01)
	bool QuestionYesSelected; // 0x572(0x01)
	int32_t QuestionRepeatLine; // 0x574(0x04)
	bool NoDelay; // 0x578(0x01)
	FMulticastInlineDelegate NextLineED; // 0x580(0x10)
	float AutoTimeDuration; // 0x590(0x04)
	bool FadeStyle; // 0x594(0x01)
	float AutoTimeTillNext; // 0x598(0x04)
	enum class TextMarkerTypes QuestionResponseAction; // 0x59c(0x01)
	FMulticastInlineDelegate Finished; // 0x5a0(0x10)
	TArray<FText> Responses; // 0x5b0(0x10)
	int32_t SelectedOptionIndex; // 0x5c0(0x04)
	bool Visible; // 0x5c4(0x01)
	UDialogText_C* InvisibleText; // 0x5c8(0x08)
	int32_t InventoryTab; // 0x5d0(0x04)
	UBlueFire_Game_Instance_C* GameInstance; // 0x5d8(0x08)
	TArray<UInventoryItem_C*> InventoryItems; // 0x5e0(0x10)
	int32_t SelectedItem; // 0x5f0(0x04)
	int32_t SelectedKeyItem; // 0x5f4(0x04)
	TArray<UInventoryItem_C*> InventoryPassiveItems; // 0x5f8(0x10)
	int32_t MaxPassiveItems; // 0x608(0x04)
	bool PlayerSell; // 0x60c(0x01)
	bool PlayerBuy; // 0x60d(0x01)
	enum class DialogType DialogType; // 0x60e(0x01)
	TArray<UShopItemWBP_C*> ShopItems; // 0x610(0x10)
	TArray<FInventory> ShopInventory; // 0x620(0x10)
	int32_t SelectedShopItem; // 0x630(0x04)
	int32_t Amount; // 0x634(0x04)
	enum class DialogType InternalDialogType; // 0x638(0x01)
	FText NPCName; // 0x640(0x18)
	bool SellConfirmation; // 0x658(0x01)
	int32_t WorldShop; // 0x65c(0x04)
	bool SellMoment; // 0x660(0x01)
	bool ShopsOpen; // 0x661(0x01)
	UAkAudioEvent* AkEvent; // 0x668(0x08)
	bool UseAkSoundsArray; // 0x670(0x01)
	TArray<UAkAudioEvent*> AkSoundsArray; // 0x678(0x10)
	float TickCounter; // 0x688(0x04)
	int32_t SellItemAmount; // 0x68c(0x04)
	bool TextLineStop; // 0x690(0x01)
	bool CanPressConfirmInput; // 0x691(0x01)
	FMulticastInlineDelegate AbilityUnlock; // 0x698(0x10)
	enum class Abilities UnlockedAbility; // 0x6a8(0x01)
	FMulticastInlineDelegate OptionChange; // 0x6b0(0x10)
	FMulticastInlineDelegate LastLineCall; // 0x6c0(0x10)
	AActor* Owner; // 0x6d0(0x08)
	bool CustomOptionTexts; // 0x6d8(0x01)
	TArray<FText> CustomOptionArrayText; // 0x6e0(0x10)
	float TextOpacity; // 0x6f0(0x04)
	ANPCBound_C* Bound; // 0x6f8(0x08)
	FMulticastInlineDelegate Exit; // 0x700(0x10)
	bool OpenBracket; // 0x710(0x01)
	bool CutsceneTextStyle; // 0x711(0x01)
	APlayer_Character_BP_C* Player; // 0x718(0x08)
	bool ShowCurrencyOnQuestion; // 0x720(0x01)
	FString SpecialString; // 0x728(0x10)
	FString SpecialStringB; // 0x738(0x10)
	int32_t SpecialStringSwitcher; // 0x748(0x04)
	bool IsRareShop; // 0x74c(0x01)
	bool ShowItemNNotCurrency; // 0x74d(0x01)
	enum class Items ItemToShow; // 0x74e(0x01)
	int32_t InventoryLength; // 0x750(0x04)

	void WriteShopArrayToGI(TArray<FInventory> Shop);
	void GetShopArray(TArray<FInventory> Array);
	void CloseTick();
	void Continue();
	void Tick(FGeometry MyGeometry, float InDeltaTime);
	void Write(FText InText);
	void UpdateActions(FText CancelAction, FText AcceptAction);
	void HideActions();
	void InitializeShop();
	void LoadShopItems();
	void UpdateShopSelectionCursor();
	void UpdateShopAction();
	void ShopMoveSelection(enum class Directions Directions, bool RefreshOnly);
	void UpdateShopActionText(bool Valid);
	void UpdateShopItemDescription();
	void ShowShopCurrency();
	void EndShop();
	void ShopConfirmInput();
	void ReloadShop();
	void ContSell(int32_t SellItemAmount);
	void UpdateShopText(FText Name, FText Description, UMaterialInterface* Material);
	void DirectSellOrb();
	void UpdateInventorySelectionCursor();
	void UpdateInventoryAction();
	void InventoryRecieveMovement(enum class Directions Directions, bool RefreshOnly);
	void ChangeInventoryTab(bool Right, bool Refresh);
	void LoadInventoryItems();
	void LoadInventoryKeyItems();
	void QuickInventoryTabChange(bool Right);
	void UpdateInventoryActionText(bool Valid);
	void InventoryConfirmInput();
	void UpdateInventoryDescription();
	void UpdateInventoryItemText(FText Description, FText Name);
	void HideInventoryDescriptionBox();
	void InitializeInventory();
	void LoadInventoryCurrency();
	void EndInventory();
	void ReloadInventory();
	void Remove();
	void NewTextLine(TArray<FText> TextLines, FText NPCName, TArray<FText> Responses, int32_t SelectedOptionIndex, enum class DialogType DialogType, int32_t Shop, bool Center, UAkAudioEvent* AkEvent, bool UseAkSoundsArray, TArray<UAkAudioEvent*> AkEvents, bool CustomOptionTexts, TArray<FText> CustomOptionArray, bool FadeStyle, bool ShowCurrencyOnQuestion, enum class Items Item, bool ShowItemNNotCurrency);
	void NextLine();
	void RecieveConfirmationInput();
	void OptionVerticalMovement(enum class Directions Direction);
	void NextLineShow();
	void SpawnControl();
	void Construct();
	void ShowDialogUI();
	void HideDialogUI();
	void OkVisible();
	void OkHidden();
	void TextConfirmation();
	void RecieveMovementInput(enum class Directions Direction);
	void RecieveCancelInput();
	void RecieveThumbstickRInput(enum class Directions Index);
	void InitializeShops();
	void HideShops();
	void TextLine(TArray<FText> TextLines, TArray<FText> Responses, int32_t SelectedOptionIndex, enum class DialogType DialogType);
	void NewInternalTextLine(TArray<FText> TextLines, TArray<FText> Responses, int32_t SelectedOptionIndex, enum class DialogType DialogType);
	void OptionsChangeAmount(bool Right, bool Max);
	void RepeatShop();
	void OptionClick();
	void SetAction();
	void ResetShopInitialize();
	void CursorMoveError();
	void SetPlatformIcon();
	void EndWrite();
	void AllowNextLine();
	void OptionChangeText(TArray<FText> Text);
	void NoBackground();
	void Update HUD();
	void GodMode(bool BlackText, float In Position Y);
	void ExecuteUbergraph_MainDialogWB(int32_t EntryPoint);
	void Exit__DelegateSignature();
	void LastLineCall__DelegateSignature();
	void OptionChange__DelegateSignature(int32_t CurrentOption);
	void AbilityUnlock__DelegateSignature(enum class Abilities Ability);
	void Finished__DelegateSignature();
	void NextLineED__DelegateSignature(int32_t CurrentLine);
	void ExitDialog__DelegateSignature();
};

