// UserDefinedStruct PlayerStatsSimple.PlayerStatsSimple
// Size: 0x24 (Inherited: 0x00)
struct FPlayerStatsSimple {
	int32_t MaxHealth_9_9ACF69B4474D76AACA0E349806254782; // 0x00(0x04)
	float MaxStamina_8_A0DAE7564A0F01238D8F6BBC0D00D733; // 0x04(0x04)
	int32_t Attack_44_ADAE7AC544F59B05D566778E248CEB3C; // 0x08(0x04)
	float Defense_79_1553754C4D37F29EFD33CCB4A21ADF54; // 0x0c(0x04)
	float Jump_80_EE135DCA4CC887BD0CC7CC97C793DBDD; // 0x10(0x04)
	float Speed_81_514A8E744A7894820378ACBFC79885EA; // 0x14(0x04)
	float Dash_82_A09DCE8E4D91FD07642F9B808B9D8AE1; // 0x18(0x04)
	float AirAttack_83_390F72024EED38B5429AB785A9C284C2; // 0x1c(0x04)
	float AttackSpeed_84_F3866ED443AEE28F191AA09098BFA796; // 0x20(0x04)
};

