// AnimBlueprintGeneratedClass Player_AnimBP.Player_AnimBP_C
// Size: 0x3639 (Inherited: 0x270)
struct UPlayer_AnimBP_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x278(0xc0)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x338(0xa0)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x3d8(0xe0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x4b8(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x570(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x598(0x28)
	FAnimNode_LookAt AnimGraphNode_LookAt_4; // 0x5c0(0x1b0)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x770(0x20)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x790(0x20)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x7b0(0xa0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x850(0xb8)
	FAnimNode_Slot AnimGraphNode_Slot_8; // 0x908(0x48)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x950(0xc0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0xa10(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0xac8(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0xaf0(0x28)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0xb18(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0xbb8(0x78)
	FAnimNode_Slot AnimGraphNode_Slot_7; // 0xc30(0x48)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8; // 0xc78(0x108)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0xd80(0x20)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0xda0(0x20)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7; // 0xdc0(0x108)
	FAnimNode_Slot AnimGraphNode_Slot_6; // 0xec8(0x48)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0xf10(0x28)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0xf38(0xa0)
	FAnimNode_LookAt AnimGraphNode_LookAt_3; // 0xfe0(0x1b0)
	FAnimNode_LookAt AnimGraphNode_LookAt_2; // 0x1190(0x1b0)
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x1340(0x48)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x1388(0xc0)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x1448(0x28)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1470(0xc0)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1530(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1558(0x28)
	FAnimNode_LookAt AnimGraphNode_LookAt; // 0x1580(0x1b0)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x1730(0x20)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x1750(0x20)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6; // 0x1770(0x108)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x1878(0x20)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1898(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1950(0x28)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x1978(0xa0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1a18(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1ad0(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1af8(0x28)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x1b20(0x108)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x1c28(0x108)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x1d30(0xa0)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1dd0(0x28)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1df8(0xc0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x1eb8(0x78)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x1f30(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x1fd0(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2048(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x20c0(0x78)
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x2138(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x21d8(0x78)
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0x2250(0x48)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x2298(0xc0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2358(0x78)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x23d0(0xa0)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2470(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2510(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2588(0x78)
	FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x2600(0xc8)
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0x26c8(0x48)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2710(0x78)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x2788(0xe0)
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2868(0x48)
	FAnimNode_Root AnimGraphNode_Root; // 0x28b0(0x30)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x28e0(0x20)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x2900(0x20)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2920(0xe0)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x2a00(0xa0)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x2aa0(0x108)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x2ba8(0x108)
	FAnimNode_Slot AnimGraphNode_Slot; // 0x2cb0(0x48)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x2cf8(0xa0)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x2d98(0x20)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2db8(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2e70(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2e98(0x28)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x2ec0(0x108)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x2fc8(0x20)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x2fe8(0x20)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3008(0xa0)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x30a8(0xe0)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3188(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x3228(0x78)
	FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x32a0(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3340(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x33b8(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x3430(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x34a8(0x78)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x3520(0x78)
	float Direction; // 0x3598(0x04)
	bool Focus; // 0x359c(0x01)
	bool Crouch; // 0x359d(0x01)
	bool IsFalling; // 0x359e(0x01)
	float VerticalSpeed; // 0x35a0(0x04)
	float Speed; // 0x35a4(0x04)
	APlayer_Character_BP_C* Char; // 0x35a8(0x08)
	FVector HeadRotation; // 0x35b0(0x0c)
	bool WallSlide; // 0x35bc(0x01)
	float WallDirection; // 0x35c0(0x04)
	bool SpellCharge; // 0x35c4(0x01)
	FVector SpellLookAtLoc; // 0x35c8(0x0c)
	bool LockedToTarget; // 0x35d4(0x01)
	float DeltaLean; // 0x35d8(0x04)
	float DeltaLeanHead; // 0x35dc(0x04)
	float HipOffset; // 0x35e0(0x04)
	float LeftEffectorLoc; // 0x35e4(0x04)
	float RightEffectorLoc; // 0x35e8(0x04)
	FVector RightJointLoc; // 0x35ec(0x0c)
	FVector LeftJointLoc; // 0x35f8(0x0c)
	bool Shield; // 0x3604(0x01)
	bool GroundPound; // 0x3605(0x01)
	int32_t Idle; // 0x3608(0x04)
	FRotator Rotation; // 0x360c(0x0c)
	float ClimbingSpeed; // 0x3618(0x04)
	bool Climbing; // 0x361c(0x01)
	float IdlePlayRate; // 0x3620(0x04)
	float GunPitch; // 0x3624(0x04)
	float HeadPitchGun; // 0x3628(0x04)
	enum class EPhysicalSurface Surface; // 0x362c(0x01)
	bool WallHang; // 0x362d(0x01)
	int32_t SetCurrentAnim; // 0x3630(0x04)
	float SwordDynamic; // 0x3634(0x04)
	bool Spell; // 0x3638(0x01)

	void AnimGraph(FPoseLink AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_LookAt_004007774EA20D5021AE569C60885B4F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_EC148A2D46E82253AADAE88A9B147F5D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_5875596245E58352222D9DA3AB7A52D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_6949B9DB4BB3F4309903238E22018ABE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_BlendListByBool_734BA1534FFFA8415E828FBDFA13B94D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_46C78F644B581544718E8F92B24A47BC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_TwoWayBlend_353472D94A720BDBA65338A6D79D9DCF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_BlendListByBool_5245B49D43A87E07369CF79908DED6E1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_1DE9121F434F5C54024DB7A5A307DC62();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_95F0F4C8455B6D193B1B26AD40A766D4();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimNotify_FootStep();
	void AnimNotify_Breath();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_289C9A714A1657409A6813891A5E8A18();
	void AnimNotify_WallRunStep();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_BlendListByBool_B58A0D694D8C905B1EAA5DB41C5C5249();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_BlendListByBool_F654155E4893336F117FD58288E92CEB();
	void ChangeIdle1();
	void StopIdles();
	void RandomIdles();
	void SitDown();
	void AnimNotify_Scratch();
	void AnimNotify_Dance();
	void AnimNotify_Pushup();
	void AnimNotify_Cloth_Single_Movement();
	void AnimNotify_grunt();
	void AnimNotify_BreathSound();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_LookAt_2FBAF4F5442E679DBE86058A5ADBC7EB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_LookAt_2F1E4CD040C213C33A4ACFA2AD5B2918();
	void AnimNotify_Handling_Stair();
	void AnimNotify_Stair_Step();
	void AnimNotify_Breakdance();
	void AnimNotify_Clap();
	void AnimNotify_Gong();
	void AnimNotify_Trompo();
	void AnimNotify_Wave_Hand();
	void AnimNotify_whoosh();
	void AnimNotify_Smug_Dance();
	void AnimNotify_Meditation();
	void AnimNotify_Emote_Intimidate_Clang();
	void AnimNotify_Emote_Photograph();
	void AnimNotify_Jump_VO();
	void AnimNotify_Land();
	void AnimNotify_Sword_Triceps_Clang();
	void AnimNotify_Triceps_Whoosh();
	void AnimNotify_VO_Shield();
	void AnimNotify_Emote_Triceps_Sword_Release();
	void AnimNotify_Confetti();
	void AnimNotify_Cheers_Public();
	void AnimNotify_Celebration();
	void AnimNotify_Hello_DoubleHand();
	void AnimNotify_TechnoEmote();
	void AnimNotify_Jump_Photo();
	void AnimNotify_Step();
	void AnimNotify_Sword_Attack();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Player_AnimBP_AnimGraphNode_ModifyBone_84217CB64C2109AF9EA324935DA93F19();
	void AnimNotify_VO_Land();
	void Reset Idles();
	void AnimNotify_Pain_Vo();
	void ExecuteUbergraph_Player_AnimBP(int32_t EntryPoint);
};

