// BlueprintGeneratedClass PlayerRenderTargetModelAlpha.PlayerRenderTargetModelAlpha_C
// Size: 0x500 (Inherited: 0x4c0)
struct APlayerRenderTargetModelAlpha_C : ACharacter {
	USceneCaptureComponent2D* Alpha; // 0x4c0(0x08)
	USceneComponent* Scene; // 0x4c8(0x08)
	UMaterialInstanceDynamic* Face_Mat; // 0x4d0(0x08)
	UMaterialInstanceDynamic* Clothes_Mat; // 0x4d8(0x08)
	UMaterialInstanceDynamic* Body_Mat; // 0x4e0(0x08)
	UMaterialInstanceDynamic* Sword_Mat; // 0x4e8(0x08)
	UMaterialInstanceDynamic* BodMat; // 0x4f0(0x08)
	UMaterialInstanceDynamic* HairMat; // 0x4f8(0x08)
};

