// AnimBlueprintGeneratedClass RenderTarget_AnimBp.RenderTarget_AnimBp_C
// Size: 0x1aa8 (Inherited: 0x270)
struct URenderTarget_AnimBp_C : UAnimInstance {
	FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x278(0x78)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x2f0(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x3a8(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x3d0(0x28)
	FAnimNode_LookAt AnimGraphNode_LookAt; // 0x400(0x1b0)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x5b0(0x20)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x5d0(0x20)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x5f0(0xa0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x690(0xb8)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x748(0xa0)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x7e8(0xc0)
	FAnimNode_Slot AnimGraphNode_Slot_5; // 0x8a8(0x48)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x8f0(0xc0)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x9b0(0xb8)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0xa68(0x28)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0xa90(0x28)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0xab8(0xa0)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xb58(0x78)
	FAnimNode_Slot AnimGraphNode_Slot_4; // 0xbd0(0x48)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0xc18(0x108)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0xd20(0x20)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0xd40(0x20)
	FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0xd60(0x108)
	FAnimNode_Slot AnimGraphNode_Slot_3; // 0xe68(0x48)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xeb0(0xe0)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0xf90(0x28)
	FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0xfb8(0xa0)
	FAnimNode_AnimDynamics AnimGraphNode_AnimDynamics; // 0x1060(0x440)
	FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x14a0(0xb8)
	FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1558(0x20)
	FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1578(0x20)
	FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1598(0x48)
	FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x15e0(0x78)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x1658(0xc0)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1718(0xc0)
	FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x17d8(0xe0)
	FAnimNode_Slot AnimGraphNode_Slot; // 0x18b8(0x48)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1900(0x28)
	FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1928(0xc0)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x19e8(0x28)
	FAnimNode_Root AnimGraphNode_Root; // 0x1a10(0x30)
	FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1a40(0x28)
	float Direction; // 0x1a68(0x04)
	bool Focus; // 0x1a6c(0x01)
	bool Crouch; // 0x1a6d(0x01)
	bool IsFalling; // 0x1a6e(0x01)
	float VerticalSpeed; // 0x1a70(0x04)
	float Speed; // 0x1a74(0x04)
	FVector HeadRotation; // 0x1a78(0x0c)
	bool WallSlide; // 0x1a84(0x01)
	float WallDirection; // 0x1a88(0x04)
	bool SpellCharge; // 0x1a8c(0x01)
	FVector SpellLookAtLoc; // 0x1a90(0x0c)
	bool LockedToTarget; // 0x1a9c(0x01)
	float DeltaLean; // 0x1aa0(0x04)
	float DeltaLeanHead; // 0x1aa4(0x04)

	void AnimGraph(FPoseLink AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RenderTarget_AnimBp_AnimGraphNode_ModifyBone_655E5E3D47C7CF57CCC41E8063444313();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RenderTarget_AnimBp_AnimGraphNode_ModifyBone_1A56C3E8440C7F69207961B92FE89D27();
	void ExecuteUbergraph_RenderTarget_AnimBp(int32_t EntryPoint);
};

