// UserDefinedStruct Save_PlayerStats.Save_PlayerStats
// Size: 0xa8 (Inherited: 0x00)
struct FSave_PlayerStats {
	int32_t Currency_10_C5BEBFCD4803BE8A33ADC7BB805F1659; // 0x00(0x04)
	int32_t MaxHealth_9_9ACF69B4474D76AACA0E349806254782; // 0x04(0x04)
	int32_t Health_16_5DB2D7FD41AA549885E1BF84BAE4BA12; // 0x08(0x04)
	float MaxStamina_8_A0DAE7564A0F01238D8F6BBC0D00D733; // 0x0c(0x04)
	float Stamina_13_63486BD942500C84BEF7BDB51839CDCF; // 0x10(0x04)
	int32_t HolyGodStones_65_D66A53D34384A8AA821D158106AAAAA7; // 0x14(0x04)
	TArray<FInventory> Inventory_23_288399C5416269F828550FB7376E7942; // 0x18(0x10)
	TArray<FInventory> PassiveInventory_48_636C916F4A37F051CF9B14A1402B4C94; // 0x28(0x10)
	int32_t MaxInventorySize_28_7264E445448038401412628B66BF9D80; // 0x38(0x04)
	int32_t EquippedInventoryItem_26_8AE108C746AA7F8CBA241AAC110F8B12; // 0x3c(0x04)
	int32_t FireOrbs_31_254F6FA346D4ECAF6F2E4B86D1E9BAFC; // 0x40(0x04)
	TArray<FBossSoul> BossSouls_35_77AEE5A04C62865566ACA490E6738ECF; // 0x48(0x10)
	int32_t Levels_85_3996A743428F6DEC04E741B8F0E2B7C4; // 0x58(0x04)
	int32_t Attack_44_ADAE7AC544F59B05D566778E248CEB3C; // 0x5c(0x04)
	int32_t Shots_51_9F546C3347C64152CEFEE1BFED498471; // 0x60(0x04)
	int32_t SpiritSlots_55_CB306EB747E6D8A63CE10DBF4E9B69B5; // 0x64(0x04)
	TArray<FGodStone_Structure> GodStones_63_E4D31BFF4F15BE1EFD9AE8AC7EDC5423; // 0x68(0x10)
	TArray<enum class Achievements> Achievements_64_2D36F2DA4F51CBA3DB1E8D9D32DB034E; // 0x78(0x10)
	int32_t KilledEnemies_71_C6CB8D2048736134B07782B4998D9DA8; // 0x88(0x04)
	int32_t TotalCurrencyCollected_70_D7E181AC47F7D24E2A6216AF1D81EE79; // 0x8c(0x04)
	float Defense_79_1553754C4D37F29EFD33CCB4A21ADF54; // 0x90(0x04)
	float Jump_80_EE135DCA4CC887BD0CC7CC97C793DBDD; // 0x94(0x04)
	float Speed_81_514A8E744A7894820378ACBFC79885EA; // 0x98(0x04)
	float Dash_82_A09DCE8E4D91FD07642F9B808B9D8AE1; // 0x9c(0x04)
	float AirAttack_83_390F72024EED38B5429AB785A9C284C2; // 0xa0(0x04)
	float AttackSpeed_84_F3866ED443AEE28F191AA09098BFA796; // 0xa4(0x04)
};

