// UserDefinedStruct TunicsInfo.TunicsInfo
// Size: 0x68 (Inherited: 0x00)
struct FTunicsInfo {
	UMaterialInstance* UIMat_2_1E90273F46CC5758B1919E8775526372; // 0x00(0x08)
	UMaterialInstance* PlayerMat_4_D12F54CC4E3C36C58B0357BF8DD17DAC; // 0x08(0x08)
	USkeletalMesh* Mesh_7_A85C980F49737C7E397E85AACD7002F4; // 0x10(0x08)
	FText Name_10_0E3B0DB349095A451758C7BC180775FF; // 0x18(0x18)
	FText Description_12_951BE9174DBF30F2AC35F2BAA8F0600D; // 0x30(0x18)
	UMaterialInstance* MaskMat_15_0792A33C49AA16AB634E27899A8B4D8D; // 0x48(0x08)
	UMaterialInstance* HairMat_19_1E43D8E34B54C40FA95D4FBDA48FDFE0; // 0x50(0x08)
	bool HasMask_22_0C4F39B7483CCCE6ECC9BC82FDF73573; // 0x58(0x01)
	bool HasHair_23_C5407D6647297D511C37C8884E365FC8; // 0x59(0x01)
	UMaterialInstance* BodyMaterial_26_1DDB49EF4B9B995792D10084C4E56496; // 0x60(0x08)
};

