// UserDefinedStruct WeaponsInfo.WeaponsInfo
// Size: 0x6c (Inherited: 0x00)
struct FWeaponsInfo {
	FText Name_16_30AE4D6349F703243AED0FA190050ADF; // 0x00(0x18)
	FText Description_15_5ABD000345BA78FA7614CBA227039A9A; // 0x18(0x18)
	UMaterialInstance* UIMat_5_D3C78EDB460DE1EF567DD09AA3F60B07; // 0x30(0x08)
	UStaticMesh* Mesh_2_31EF70B847CCAA9B124EBAB5EA69A5BD; // 0x38(0x08)
	UMaterialInstance* SwordMat_19_683F65804184D86601CB1494FAF46D25; // 0x40(0x08)
	FLinearColor FXColor_22_8801C782491AA72AFA981E87524F4609; // 0x48(0x10)
	int32_t RecoveryTime_45_2E12388C4C919D03E3D4AE95CCA6DF8D; // 0x58(0x04)
	int32_t Attack_46_1A92BD4A44651894390604BFB7F5803B; // 0x5c(0x04)
	int32_t BounceHeight_47_8400C9A84EB3F8B2A26D119C3981F78F; // 0x60(0x04)
	int32_t Range_48_F2A8D20F4407589E46F63B9E35ADA18D; // 0x64(0x04)
	int32_t MovementSpeed_49_BB65290C4E58ECE37A754EBB1422696D; // 0x68(0x04)
};

