// UserDefinedStruct Inventory.Inventory
// Size: 0x19 (Inherited: 0x00)
struct FInventory {
	enum class Items Item_3_54327288464702F41977D48660F8979E; // 0x00(0x01)
	int32_t Amount_6_185C591747EF40A592FB63886FDB4281; // 0x04(0x04)
	bool Resets_8_E303F5DF4270CCEE83F05F974F3661C9; // 0x08(0x01)
	int32_t OriginalAmount_11_58C3C17D426D49A439C0EE85D7E9B6EC; // 0x0c(0x04)
	enum class InventoryItemType Type_17_9B84CFD04716464F71190CB4CECE0F49; // 0x10(0x01)
	enum class Tunics Tunic_23_B7D465CA4DCF57F409450789A6DB8590; // 0x11(0x01)
	enum class Weapons Weapon_22_F3B61F384438EE8A8193F385AE45F88A; // 0x12(0x01)
	enum class Spirits Spirit_21_55691F2E4B399DB3F381209D33BBE30B; // 0x13(0x01)
	int32_t Price_26_80A37F3645AE8292A9F311B86094C095; // 0x14(0x04)
	enum class Abilities Ability_29_EBF42DD143E9F82EC9303082A50329F0; // 0x18(0x01)
};

