// UserDefinedStruct Save_GameSettings.Save_GameSettings
// Size: 0x30 (Inherited: 0x00)
struct FSave_GameSettings {
	int32_t InvertedCamHor_22_C5BEBFCD4803BE8A33ADC7BB805F1659; // 0x00(0x04)
	int32_t InvertedCamVer_21_9ACF69B4474D76AACA0E349806254782; // 0x04(0x04)
	int32_t ProHUD_20_5D2335B44B88B88D09FB219CC14DD170; // 0x08(0x04)
	int32_t Language_23_16EED8CF404D5F60C7CFB989E16029D3; // 0x0c(0x04)
	int32_t CameraSensitibity_10_C263A6C645226A1F0BC57792B7A79875; // 0x10(0x04)
	int32_t CamAutoFollowSpeed_33_F0A83B684038779E4035D2A14507947E; // 0x14(0x04)
	bool SmoothCamRotation_36_18F3254C4C799FF96CB7C782FF2230CC; // 0x18(0x01)
	int32_t CamDistance_41_5FAC07C5401D7E7A739F6F80622AC327; // 0x1c(0x04)
	bool BreathCam_42_5A279EA14214484EB6936B91B0EDB4D2; // 0x20(0x01)
	bool CamShakes_46_6237FA954A641DB486CF8088DC7C189E; // 0x21(0x01)
	int32_t FPSLimit_48_9193D036453D53A439B1A78F75F2DFBC; // 0x24(0x04)
	bool MotionBlur_49_215636F64139ED011DFA218D113B1723; // 0x28(0x01)
	int32_t ControlVibration_52_A4F72BF346E5B07D122EF8B6EF36263E; // 0x2c(0x04)
};

