// UserDefinedStruct Save_GameStats.Save_GameStats
// Size: 0x48 (Inherited: 0x00)
struct FSave_GameStats {
	float TimePlayed_8_C5BEBFCD4803BE8A33ADC7BB805F1659; // 0x00(0x04)
	TArray<FString> Events_7_9ACF69B4474D76AACA0E349806254782; // 0x08(0x10)
	float Percentage_18_766629A84559284CFB4C95AC6BA812C4; // 0x18(0x04)
	int32_t VoidsCleared_17_02733D914ACF38F114FFD99FEB2DEBDD; // 0x1c(0x04)
	bool BeatGame_20_C4BABD254A2D5AE93BB7AE83D78C3FEC; // 0x20(0x01)
	TArray<FString> PercentageStrings_24_DB4F248C40C6C15F5FF2AEAA5BD1658D; // 0x28(0x10)
	int32_t PercentageINT_27_1C181F9949AE4C28423EA5B56B63766C; // 0x38(0x04)
	float TimePlayedNet_30_9C7034A74A26CCA81A60D48D43B5F11F; // 0x3c(0x04)
	bool BeatDLCVoidMaster_32_7C4CC3884F04A2ACB32AEEB0BE17064A; // 0x40(0x01)
	float TimePlayedDLC_35_1DC0EE1C48D6B3243EA67896479D390B; // 0x44(0x04)
};

