// UserDefinedStruct Save_Settings.Save_Settings
// Size: 0x25 (Inherited: 0x00)
struct FSave_Settings {
	float MusicVolume_13_C5BEBFCD4803BE8A33ADC7BB805F1659; // 0x00(0x04)
	float SFXVolume_14_9ACF69B4474D76AACA0E349806254782; // 0x04(0x04)
	int32_t Resolution_15_B1C291E4446F491FF61944B04EF0429F; // 0x08(0x04)
	int32_t Antialising_16_0A65316C44647142FEDF9694472A2FBB; // 0x0c(0x04)
	int32_t PostProcess_17_717BC3B046EF243910C5E99B1CD50A04; // 0x10(0x04)
	int32_t ShadowQuality_18_1EA5CB92401205E7A9B196865F38EAF8; // 0x14(0x04)
	int32_t TextureQuality_19_9BA919644182B3154EBFCD94AC262AB0; // 0x18(0x04)
	int32_t EffectsQuality_20_C625976B431669033CA47893D7A9F64E; // 0x1c(0x04)
	int32_t ScreenMode_26_41C8CDAD43037C04994C408BC014A4A0; // 0x20(0x04)
	bool StadiaPerformanceMode_30_E1AB1F964B632FB4470DD98F2A49845B; // 0x24(0x01)
};

