// UserDefinedStruct Save_PlayerAbilities.Save_PlayerAbilities
// Size: 0x0a (Inherited: 0x00)
struct FSave_PlayerAbilities {
	bool Attack_10_351804CD4B3F2EFBDC0B2DAAA7ED7238; // 0x00(0x01)
	bool Dash_8_C5BEBFCD4803BE8A33ADC7BB805F1659; // 0x01(0x01)
	bool DoubleJump_9_9ACF69B4474D76AACA0E349806254782; // 0x02(0x01)
	bool WallJump_12_8CC261B848F97BE432C43FBFDFB65D1D; // 0x03(0x01)
	bool Sprint_21_A2EA9CA54248830C70D2A096307CA144; // 0x04(0x01)
	bool DownSmash_22_84DE6230457D45C1BBF111BBA6DDE737; // 0x05(0x01)
	bool Spell_23_EFD583FD46ED9B47C8C80EBEEB3D9753; // 0x06(0x01)
	bool Grind_19_5D0328FB486C70BF86BFD58EAB4CE52D; // 0x07(0x01)
	bool Block_25_5710D9FB4D2A4FF88972508279869DF4; // 0x08(0x01)
	bool SpinAttack_27_19AE29114077C361BA4934AD401C4A0B; // 0x09(0x01)
};

